Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: That man is a Cherokee medicine man.
chr: Ꮎ ᎠᏍᎦᏯ ᎠᏣᎳᎩ ᏗᏓᏅᏫᏍᎩ.

source: That little boy wants to become a surgeon when he grows up.
chr: Ꮎ ᎤᏍᏗ ᎠᏧᏣ ᏗᏓᏰᏠᎯ ᎢᏳᎵᏍᏙᏗ ᎤᏚᎵ ᎠᏛᏒᎢ.

source: He went back home a while ago.
chr: ᏗᏓᏁᎸ ᏨᎤᏪᏅᏒ ᎪᎯ.

source: An old man is cleaning some dentures.
chr: ᎤᏛᏐᏅ ᏗᏓᏅᏙᏍᏗ ᏕᎦᏅᎦᎵᎠᎭ.

source: Some men are working in the cemetery mowing grass.
chr: ᏗᏓᏂᏐᏗ ᏚᏂᎸᏫᏍᏓᏁ ᎠᏂᏍᎦᏯ ᎦᏄᎸ ᎠᏂᎦᎵᏍᎦ.

source: I want to talk with a policeman.
chr: ᏗᏓᏂᏱᏍᎩ ᎣᎩᎾᏟᏃᎮᏗ ᎠᏆᏚᎵ

source: He chose five cooks to cook.
chr: ᎯᏍᎩ ᎢᏯᏂᎢ ᏗᎾᏓᏍᏓᏴᎲᏍᎩ ᏚᏑᏰᏒ ᎤᎾᏓᏍᏓᏴᏗᎢ.

source: He went to a school for barbers.
chr: ᏗᎾᏓᏍᏙᏰᏍᎩ ᏧᎠᏕᏠᏆᏍᏗ ᏚᏕᏠᏆᎥᎢ.

source: Have you been in jail?
chr: ᏣᏴᏢᎢᏍ ᏧᎾᏓᏍᏚᏗ?

source: Where's the leader of your group?
chr: ᎭᏢ ᏗᏓᏘᏂᏙᎯ ᎢᏣᏓᏡᎬᎢ?

source: They formed a loan association in a big city.
chr: ᎠᏕᎳ ᏗᎾᏓᏙᎵᏍᏗᏍᎩ ᎤᎾᏙᏢᏅ ᎤᏔᎾ ᎦᏚᎲᎢ.

source: He became a deacon in a First Baptist Church.
chr: ᎢᎬᏱ ᏗᎾᏓᏬᏍᎩ ᏧᏂᎳᏫᏍᏗ ᎠᏯᏙᎯᎯ ᏄᎵᏍᏔᏅᎢ.

source: Ninety students graduated this spring.
chr: ᏐᏁᎳᏍᎪᎯ ᎢᏯᏂᎢ ᏗᎾᏕᏠᏆᏍᎩ ᏚᏂᏍᏆᏛ ᎪᎯ ᎪᎨᏱ.

source: She's been a teacher for a few years.
chr: ᎢᎸᏍᎩ ᏧᏕᏘᏴᏓ ᏗᏕᏲᎲᏍᎩ ᏂᎨᏐᎢ.

source: I saw him walking toward the road.
chr: ᏅᏃᎯ ᏗᏜ ᏩᎢᏒ ᏧᏫᏥᎪᏩᏔ.

source: I couldn't find the meeting place.
chr: ᎠᏆᏠᏨ ᎤᎿ ᎪᏢᏒ ᏗᏠᎯᏍᏗᎢ.

source: Don't let excuses get in your way.
chr: ᏞᏍᏗ ᏗᏢᏈᏍᏙᏗ ᎢᎬᏱ ᏗᏜ ᏥᏂᏣᏛᏁᎵ.

source: How much does a bushel of pears cost?
chr: ᎯᎳ ᏧᎬᏩᎵᏗ ᏑᏟᎶᏓ ᏗᎦᏛᏗ?

source: How many churches are there in the city of Tahlequah?
chr: ᎯᎳ ᎢᎦ ᏕᎪᏢ ᏧᏂᎳᏫᏍᏗ ᏓᎵᏆ ᎦᏚᎲᎢ?

source: The long-eared hound dog got his ear caught in the fence because his ear was so long.
chr: ᏗᎦᎴᏅᎯᏓ ᎩᏟ ᏗᎦᎴᏅᎯᏓ ᎠᏏᎳᏛ ᎤᏭᏓᎸᏤᎸ ᎦᎴᏂ ᎦᏅᎯᏒ.

source: The farmer's crop became dry because of no rain.
chr: ᏗᎦᎶᎩᏍᎩ ᎤᏫᏒᏅ ᎤᎧᏲᏐᏅ ᎾᎦᏍᎬᎾ ᎨᏒ ᎢᏳᏍᏗ.

source: Do you think there are enough dumplings?
chr: ᎡᎵᏊᏍ ᏂᎦᎠ ᏗᎦᎸᏅᎯ ᎮᎵᎠ?

source: Does anyone have an announcement?
chr: ᎩᎶᏍ ᎪᎱᏍᏗ ᏗᎦᏃᏣᎸᏗ ᎤᎭ?

source: She put the pies in the pantry.
chr: ᏗᎦᎾᏐᏗ ᏫᏚᏝᏅᏗᎨᎵᏍᏘᎩ.

source: He's ticklish in his ribs.
chr: ᏗᎦᏄᎳᏥ ᏧᏴᎩᏌᏘ.

source: I have bread in the oven.
chr: ᏗᎦᏘᏗ ᏩᎩᏝ ᎦᏚ.

source: Some people use gigs whenever they hunt crawdads.
chr: ᎢᎦᏓ ᏗᎦᏘᏍᏗ ᏓᏅᏗᏍᎪ ᏥᏍᏛᎾ ᏱᏚᏂᏯᎳ.

source: I am reading a book.
chr: ᏗᎪᏪᎵ ᏕᏥᎪᎵᏰᎠ.

source: While they were wrestling, he was accidently stabbed with a pencil.
chr: ᎠᎾᏁᎯᎲ ᏗᎪᏪᎶᏗ ᎬᏗ ᎠᏥᏘᏍᏙᏔᏅᎢ.

source: He asked for a discussion when he read the Bible.
chr: ᏗᎪᏏᏐᏗ ᎤᏔᏲᏢ ᎦᎸᏉᏗ ᎪᏪᎵ ᎤᎪᎵᏰᎠ.

source: I just saw a mud dauber sting a spider.
chr: ᎧᎾᏁᏍᎩ ᎦᏨᏍᎬ ᏥᎪᏩᏔ ᏗᎫᎵᏗᏍᎩ.

source: The judge sentenced him to thirty days in jail.
chr: ᏦᏍᎪ ᏧᏒᎯᏓ ᏧᎾᏓᏍᏚᏗ ᎤᏴᏍᏗ ᏚᏬᎪᏓᏁᎸ ᏗᎫᎪᏗᏍᎩ.

source: He has a dog that's a snake killer.
chr: ᎢᎾᏓ ᏗᎯᎯ ᎩᏟ ᎤᏩᎧᎭ.

source: Do you hear a telephone ringing?
chr: ᏗᏟᏃᎮᏗᏍ ᎤᏃᏴᎬ ᎭᏛᎩ?

source: He wants to become a high jumper.
chr: ᎦᎸᎳᏗ ᏗᎵᏔᏕᎩ ᎢᏳᎵᏍᏙᏗ ᎤᏚᎵᎭ.

source: The wealthy have expensive clothes.
chr: ᏧᏁᎿᎢ ᏥᏈᏍᏗ ᏧᎬᏩᎵᏗ ᏗᎿᏬ ᏚᏂᎾᎣᎢ.

source: How many covers do you want?
chr: ᎯᎳ ᎢᎦ ᏗᎿᏬᏍᏙᏗ ᏕᏣᏚᎵᎭ?

source: I was a wrestler when I was in the twelfth grade.
chr: ᏗᎦᏁᎯᎯ ᎨᏒ ᏔᎵᏚᏏᏁ ᏗᏥᏂᏙᎯ ᏥᎨᏒᎢ.

source: A carpenter is buying some tools.
chr: ᎬᏔᏅᏙᏗ ᎤᏩᏒᏍᎦ ᏗᏁᏍᎨᏍᎩ.

source: He has spurs on his boots.
chr: ᏗᏴᎩᏍᏗ ᏂᏚᏩᏅᏗ ᏚᎳᏑᏢᎢ.

source: I learned to read Cherokee when I was fourteen years old.
chr: ᏂᎦᏚ ᎢᏯᏆᏕᏘᏴᏓ ᏥᎨᏒ ᎠᏆᏕᏠᏆᎥ ᏗᏣᎳᎩ ᏗᎩᎪᎵᏰᏗᎢ.

source: He went toward the east.
chr: ᏗᎧᎸᎬ ᏗᏜ ᏭᎶᏒᎢ.

source: They use musical instruments when they sing.
chr: ᏗᎧᏃᎩᏍᏗ ᏓᏅᏗᏍᎪ ᏱᏚᏂᏃᎩᏌ.

source: Do angels have wings?
chr: ᏓᏃᏯᏓᏍ ᏗᏂᎧᏃᏩᏗᏙᎯ?

source: When some people break the law, they get away with it.
chr: ᏗᎧᏃᏩᏛᏍᏗ ᏱᏚᏂᏲᏍᏔᎾ ᎢᎦᏓ ᎬᏩᎩᏘ ᎾᎾᏛᏁᎰᎢ.

source: The firemen have three new firetrucks.
chr: ᏦᎢᎭ ᏗᏤ ᏗᎬᏜᏗᏍᎩ ᏚᏂᎭ ᏗᏅᏜᏗᏍᎩ.

source: Hand me a sharpener . I'm going to sharpen a knife.
chr: ᏗᎬᏢᏗ ᎡᏍᎬᏏ. ᎭᏰᎵᏍᏗ ᏓᎬᏢᎯ.

source: This man is blind.
chr: ᎯᎠ ᎠᏍᎦᏯ ᏗᎨᏫ.

source: He had to get eyeglasses.
chr: ᏗᎦᏘᏅᏘᏗ ᏧᎩᏍᏗ ᏄᎵᏍᏔᎾᎢ.

source: If you look at him with binoculars, you'll recognize him.
chr: ᏗᎦᏙᏗ ᎬᏗ ᏳᏫᏯᎦᏔᎿ ᏱᏲᎵᎩ.

source: He lost a new deck of cards.
chr: ᏗᏤ ᏗᏆᎾᏲᏍᏗ ᏚᏲᎱᏏ.

source: I put pepper on my eggs.
chr: ᏗᏆᏲᏗ ᏕᏥᏆᏲᎥᏍᎪ ᏧᏪᏥ.

source: She likes to use sharp scissors while sewing.
chr: ᏗᎪᏍᏓᏱ ᏗᎵᏍᏙᏰᏗ ᏧᏮᏙᏗ ᎤᎸᏉᏗ ᎦᎮᏫᏒᏍᎬᎢ.

source: Are these boys brothers? His brother is coming in a little while.
chr: ᏗᎾᏓᏅᏟᏍ ᎯᎠ ᎠᏂᏧᏣ? ᎪᎯᏴ ᏓᎦᎷᏥ ᏗᎾᏓᏅᏟ.

source: Did you get the toy you wanted?
chr: ᏣᏚᎵᏍᎬᎢᏍ ᎢᏳᏍᏗ ᏗᏁᎵᏙᏗ ᏣᎩᏎ?

source: Why did they become enemies? When he saw his enemy coming, he ran away.
chr: ᎦᏙᎲ ᏗᏂᏓᎿᏫ ᏄᎾᎵᏍᏔᏁᎢ? ᏗᏂᏓᎿᏫ ᏣᎢᏒ ᏭᎪᎭ, ᎤᎵᏘᏒᎢ.

source: Help me move a dresser.
chr: ᏗᏎᎯᏍᏗ ᎦᏍᎩᎵᏴᏒ ᏍᎩᏍᏕᎳ.

source: Do you know your numbers?
chr: ᏕᎯᎦᏔᎭᏍ ᏗᏎᏍᏗ?

source: I want three gallons of paint.
chr: ᏦᎢ ᎢᏳᏟᎶᏓ ᏓᏟᏍᏛ ᏗᏑᏫᏍᏗ ᎠᏆᏚᎵᎭ.

source: I am looking for an electric drill.
chr: ᎠᎾᎦᎵᏍᎩ ᎠᏂᎩᏍᏗᏍᎩ ᏗᏔᎴᏍᏗ ᎠᎩᏲᎭ.

source: The iron isn't heating up.
chr: Ꮭ ᏯᏖᏴᏍᎦ ᏗᏖᏍᏗ.

source: When did he become a lawyer?
chr: ᎯᎳ ᎢᏴ ᏗᏘᏲᎯᎯ ᏄᎵᏍᏔᏁ?Ꭲ?

source: Someone is gathering poke.
chr: ᎩᎶ ᏜᎢᏓ ᏂᎬᎾᏕᏏᏙᎭ.

source: Bats live in caves.
chr: ᎤᏍᏓᎦᎸ ᎠᏂᏁᎶᎢ ᏜᎺᎭ.

source: How big do leeches get?
chr: ᎯᎳ ᎢᏗᏂᏓ ᎾᎾᎵᏍᏗᏍᎪ ᏜᏄᏏ?

source: The town of Jay, Oklahoma, was named after the bluejay.
chr: ᏜᏱᎬ, ᎣᎦᎳᎰᎻ, ᎦᏚᎲ ᏥᎩ ᏜᏱᎦ ᏚᏙᏍᏔᏁᎢ.

source: He's in jail in Jay.
chr: ᏜᏱᎬ ᏧᎾᏓᏍᏚᏗ ᏩᏯᎠ.

source: He works all day in the field plowing.
chr: ᎤᏙᏓᏆᏓ ᏚᎸᏫᏍᏓᏁᎰ ᏠᎨᏏ ᎦᏓᎷᎩᏍᎬᎢ.

source: A little boy made a bird house for martins.
chr: ᏡᏡ ᎤᏂᏴᏍᏗ ᎤᏬᏢᏅ ᎤᏍᏗ ᎠᏧᏣ.

source: I will get there about ten o'clock.
chr: Ꮲ ᏍᎪᎢ ᎢᏳᏩᏂᎸ ᏗᏓᏥᎷᏥ.

source: We met somewhere down the road.
chr: ᏫᎦᏅᏅ Ꮲ ᏥᏕᎦᏠᏒ.

source: Let's go swimming Sunday afternoon.
chr: ᎢᎾᏓᏬᎡᏒ ᏙᏓᏆᏍᎬ ᏒᎯᏰᏱ ᏗᏜ.

source: How early do you get up on Saturday mornings?
chr: ᎯᎳ ᎢᏏᎾᎴ ᎭᏗᏗᏍᎪ ᏙᏓᏈᏕᎾ ᏑᎾᎴᎢ?

source: He's returning a week from Monday.
chr: ᏙᏓᏆᏅ ᏒᎾᏙᏓᏆᏍᏗ ᏛᎦᎷᏥ.

source: It's really cold outside.
chr: ᏙᎯᏳ ᎤᏴᏜ ᏙᏱ.

source: Ouch! A mosquito bit me.
chr: ᎠᏲ! ᏙᏌ ᎠᎦᏍᎦᎳ.

source: Ants are always working.
chr: ᏙᏒᏓᎵ ᏂᎪᎯᎸ ᏚᏂᎸᏫᏍᏓᏁᎰᎢ.

source: He came from outside.
chr: ᏙᏱ ᏓᎦᎶᎯ.

source: It's really cold outside, isn't it?
chr: ᏙᏳ ᎤᏴᏜ ᏙᏱ, ᏙᎧ?

source: He took his family to a ball game.
chr: ᏗᎾᎳᏍᎦᎵᏍᎬ ᏚᏘᏅᏒ ᏚᏓᏘᎿᎥᎢ.

source: No one likes to be confronted with a bad feeling.
chr: Ꮭ ᎩᎶ ᎤᎸᏉᏗ ᎤᏲ ᎠᏓᏅᏓᏗᏍᏗ ᏧᏠᎯᏍᏗᎢ.

source: My dog's name is "Chief."
chr: "Chief" ᏚᏙᎠ ᎩᏟ ᎠᏆᏤᎵᎢ.

source: He tried hard not to stagger.
chr: ᏍᏓᏱ ᎤᏁᎵᏔᏅ ᏧᏙᎦᏙᏗ ᏂᎨᏒᎾ.

source: If he walks in the hot sun, he gets a rash.
chr: ᎤᏗᏞᎩ ᎠᎦᎵᏍᎬ ᏳᏪᏙᎳ ᏚᏇᏃᏘᏍᎪᎢ.

source: It had horns four feet long.
chr: ᏅᎩ ᎢᎳᏏᏗ ᎢᏗᎦᏅᎯᏓ ᏚᎷᎬᎢ.

source: Dust makes me sneeze.
chr: ᎪᏍᏚ ᏓᎩᏴᏍᏙᏯᏍᏗᏍᎪᎢ.

source: I wonder what's causing him to vomit.
chr: ᎦᏙᏍᎩᏂ ᎤᏍᏗ ᏄᏩᏁ ᏥᏚᎦᏍᏗᎭ.

source: When she's out in the sun, she wears dark glasses.
chr: ᎠᎦᎵᏍᎬ ᏰᏙ ᏧᎵᏏᎩ ᎤᎦᏘᏅᏙᎢ.

source: A boy is walking around without his shoes on.
chr: ᏂᏚᎳᏑᏢᎾ ᎠᏨᏏᏰᎠ ᎠᏧᏣ.

source: Cherokee Holiday is held at Tahlequah in the month of September.
chr: ᏚᎵᏍᏗ ᎧᎸ ᎠᏂᏣᎳᎩ ᏓᎵᏆ ᎤᏂᏍᏆᎸᎡᎰ ᎤᎾᏕᏘᏱᏍᎬᎢ.

source: I don't like to wear gloves when I'm working.
chr: Ꮭ ᏯᎩᎸᏉᏗ ᏗᏆᎵᏰᏑᎶᏗ ᏱᏓᎩᎸᏫᏍᏓᏁᎭ.

source: What color socks is he wearing?
chr: ᎦᏙ ᎤᏍᏗ ᏧᎵᏑᏫᏓ ᏚᎵᏲᎭ?

source: I see a squirrel in the fork of a tree.
chr: ᏡᎬ ᏚᎶᏥᎬ ᎤᎩᎸ ᏥᎪᏩᏘᎭ ᏌᎶᎵ.

source: That student works all day Saturday.
chr: Ꮎ ᏗᏕᏠᏆᏍᎩ ᏙᏓᏈᏕᎾ ᎤᏙᏓᏆᏓ ᏚᎸᏫᏍᏓᏁᎰᎢ.

source: He hasn't been here since the month of October.
chr: ᏚᏂᏂᏗ ᏥᎦᎸ ᎬᏪᏙᎸᎢ.

source: I hear someone making footsteps.
chr: ᎩᎶ ᏚᏍᏓᏃᏴᎬ ᎦᏛᎩᎠ.

source: When he pulled the rope hard, it slipped out of my hand.
chr: ᏍᏓᏯ ᏧᎾᏌᏁᏌ ᏍᏕᏱᏓ, ᏓᏆᏍᎦᎴᏍᏔᏅ.

source: Is he tired when he returns from home from work?
chr: ᏚᏯᏪᎪᏍ ᏱᎤᎷᏣ ᏣᎸᏪᏍᏓᏁᎵᏙᎸ?

source: Why did you let go of the rope?
chr: ᎦᏙᎲ ᏙᏣᏲᎯ ᏍᏕᏱᏓ?

source: I am telling you the truth.
chr: ᏚᏳᎪᏛ ᎬᏃᎯᏎᎭ.

source: They are walking around barefoot. Is your family here?
chr: ᏂᏚᎾᎳᏢᎾ ᎠᏁᏙᎭ. ᎠᏁᏙᎭᏍ ᏕᏣᏓᏘᎿᎥ?

source: I am going far away.
chr: ᎢᎾ ᎨᎦ.

source: They are building a large house.
chr: ᎡᏆ ᎦᎵᏦᏕ ᎠᎾᏁᏍᎨᎭ.

source: The soldiers crossed the sea in a ship.
chr: ᏥᏳᎯ ᏚᏂᏐᏨ ᎡᏉᏂ ᎠᎾᏁᏍᎨᎭ.

source: He lived in Tahlequah for five years.
chr: ᎯᏍᎩ ᏧᏕᏘᏴᏓ ᎡᎲ ᏓᎵᏆ.

source: Where are those ball players from?
chr: ᎭᏢ ᎠᏁᎯ Ꮎ ᎠᎾᎳᏍᎦᎵᏍᎩ?

source: Indians are indigenous to America.
chr: ᎠᏂᏴᏫᏯ ᎠᎹᏰᏟ ᎠᏁᎯᏯ.

source: The people were quiet while the speaker spoke.
chr: ᎡᏝᏪ ᎨᏒ ᏴᏫ ᎦᏬᏂᏍᎩ ᎦᏬᏂᏍᎬ ᎢᎪᎯᏓ.

source: He's watching animals on the television.
chr: ᎡᎿᎢ ᎠᎾᏓᏴᎳᏛᏍᎬ ᏚᎦᏙᏍᏗ.

source: He sat down. Did you come on foot?
chr: ᎡᎳᏗ ᎤᎵᏍᏛᎷᏅᎢ. ᎡᎳᏗᏍ ᎯᎷᎩ?

source: They're coming back shortly, I think.
chr: ᎩᎳᏊ ᏛᎠᏂᎷᏥ ᎨᎵᎠ.

source: That's enough!
chr: ᎡᎵᏊ!

source: Can you take me to town?
chr: ᎡᎵᏊᏍ ᏗᎦᏚᎲ ᏳᏪᏍᎩᎦᎲᎦ?

source: It seems like he would say where he is going.
chr: ᎡᎵᏍᏗ ᏱᎦᏃᎲᎳ ᎤᎿ ᎡᎬᎢ.

source: If there was a straight road, it would have been all right.
chr: ᎦᏥᏃᏍᏓ ᏳᏪᎦᏅᏁ ᎣᏏ ᏱᎨᏎ.

source: The water pipe bent, but he straightened it out.
chr: ᎠᎹ ᎤᎶᎯᏍᏗ ᎤᏒᏙᏂ ᎤᏥᏈᏛᏁᎸ ᎠᏎᏅ ᎤᏩᏥᏃᏌᏅᎢ.

source: We live in a dirty world; no matter where we go we see dirt.
chr: ᎦᏓᎭ ᎡᎶᎯ ᎢᏕᎭ; ᎭᏢᏊ ᏳᏫᎩᎷᏣ ᎦᏓ ᎢᏗᎪᏩᏘᏍᎪi.

source: What's that hanging on the post?
chr: ᎦᏙ ᎤᏍᏗ Ꮎ ᏥᎦᏓᎠ ᎨᏛᎢ?

source: How old is that flag?
chr: ᎯᎳ ᏄᏪᏘᏯ Ꮎ ᎦᏓᏗ?

source: Did you make this crock?
chr: ᏂᎯᏍ ᏦᏢᏁ ᎯᎠ ᎦᏓᎫᎫ?

source: He has a pipe made of clay.
chr: ᎦᏓᏆᎳ ᎪᏢᏔᎾ ᎦᏅᏄᏬᏩ ᎤᏩᏯ.

source: He didn't want to drive a dirty car, so he washed it.
chr: Ꮭ ᏳᏚᎸᎮ ᎦᏓᎭ ᏓᏆᎴᎳ ᎤᎯᎸᏍᏗ, ᎥᏍᎩᏅ ᎢᏳᏍᏗ ᎤᏅᎦᎸᎲᎢ.

source: Long ago the farmers used horses for plowing the fields .
chr: ᎪᎯᎩᏴ ᏥᎨᏎ ᏗᏂᎶᎩᏍᎩ ᏐᏈᎵ ᏓᏅᏗᏍᎨ ᏓᏂᏓᎷᎩᏍᎬ ᏠᎨᏏ.

source: Have you used a horse-drawn plow?
chr: ᏨᏔᏅᎢᏍ ᏐᏈᎵ ᎤᏂᎾᏌᏁᏍᏗ ᎦᏓᎷᎪᏗ?

source: He picked a ripe apple to eat. Take the shirt down from the line.
chr: ᏒᎦᏔ ᎤᏩᏂᏒ ᎤᎩᏍᏗ ᎤᏕᏒᎢ. ᎭᏓᎩ ᎠᎿᏬ ᎠᏏᎳᏛ ᏥᎦᏓᎠ.

source: Turn it to the left.
chr: ᎠᎦᏍᎦᏂ ᏗᏜ ᎯᏕᏯᏍᏓ.

source: A broken glass cut his heel when he stepped on it while wading in water.
chr: ᎦᏗᎨᏂ ᎤᏰᏝᎸ ᎫᎫ ᎤᏲᏨ ᎤᎳᏍᏛᏔᎾ ᎠᎹᏱ ᎠᏚᎯᏂᏙᎲᎢ.

source: Can you spin the wheel?
chr: ᎡᎵᏊᏍ ᏱᏗᏆᎸᏕᏯᏍᏓ ᎦᏆᏛᎢ?

source: He strapped the box with some leather.
chr: ᎦᏃᏥ ᎬᏗ ᎤᏩᏠᏢ ᎧᏁᏌᎢ.

source: What are you doing? Nothing much. I'm just reading a book. What's wrong with you? I'm sleepy.
chr: ᎦᏙ ᎭᏛᏁᎭ? Ꮭ ᎤᏟ ᎢᎦ ᎪᎱᏍᏗ. ᏗᎪᏪᎵᏊ ᏕᏥᎪᎵᏰᎠ. ᎦᏙ ᏣᎵᏍᏓᏁᎭ? ᏥᎸᏍᎦ.

source: The policemen were standing outside when I got there.
chr: ᏙᏱ ᏗᏜ ᏓᏂᏙᎬ ᏗᎾᏓᏂᏱᏍᎩ ᏩᎩᎷᏣ.

source: Children like to play on the ground.
chr: ᏗᏂᏲᏟ ᎤᏂᎸᏉᏗ ᎦᏙᎯ ᏧᎾᏁᎶᏗᎢ.

source: Why didn't you come when I was calling you?
chr: ᎦᏙᎲ ᏂᏗᏤᏅᏓ ᏧᏫᎬᏯᏂᏍᎬ?

source: I just feel sorry for him.
chr: ᏥᏯᏙᎵᎦᏊ.

source: When he got tired of holding the coat, he dropped it.
chr: ᏚᏯᏪᏣ ᎦᏌᎴᏂ ᎦᏁᎲ, ᎤᏙᏅᏔᏅᎢ.

source: The shirt fell from the line.
chr: ᎠᏏᎳᏛ ᎦᏛ ᎠᎿᏩ ᎤᏙᏒᎢ.

source: Which color are you going to paint it?
chr: ᎦᏙ ᎤᏍᏗ ᎤᎵᏑᏫᏓ ᏘᏑᏫᏍ?

source: What do you see? A green pencil. What do you want? I want you to help me.
chr: ᎦᏙ ᎤᏍᏗ ᎯᎪᏩᏘᎭ? ᎢᏤ ᎢᏳᏍᏗ ᏗᎪᏪᎶᏗ. ᎦᏙ ᎤᏍᏗ ᏣᏚᎵᎭ? ᏍᎩᏍᏕᎸᏗ ᎠᏆᏚᎵ.

source: The mirror is on top of the dresser.
chr: ᏗᏎᎯᏍᏗ ᎦᏚ ᎠᏝᎭ ᎠᏓᎨᏗ.

source: Long ago, Cherokees helped each other through cooperative labor.
chr: ᎪᎯᎩ ᏥᎨᏒ, ᎦᏚᎩ ᏓᎾᎵᏍᏕᎵᏍᎬ ᎠᏂᏣᎳᎩ.

source: What's the population of the town of Tahlequah?
chr: ᎯᎳ ᎾᏂᎠ ᏴᏫ ᎠᏁᎭ ᏓᎵᏆ ᎦᏚᎲᎢ?

source: She's getting ready to bake a cake.
chr: ᎦᏚ ᎤᎦᎾᏍᏓ ᎤᏩᏘᏗ ᎠᏛᏅᎢᏍᏗᎭ.

source: When the photos got wet, they were ruined.
chr: ᏗᎦᏚᎵᏓ ᏂᏚᎵᏍᏔᎾ ᏗᏓᏟᎶᏍᏔᏅ, ᏚᏲᏨᎢ.

source: Forest rangers build lookout towers on hills.
chr: ᏌᎷᏱ ᎤᎾᎦᏎᏍᏗ ᎦᏚᏏ ᏓᏁᏛᏍᎪ ᏧᎾᎦᏙᏗᎢ.

source: She baked a cake for her son's birthday.
chr: ᎦᏚ ᎤᎦᎾᏍᏓ ᎤᏩᏚᏅ ᎤᏪᏥ ᎠᏧᏣ ᏚᏕᏘᏱᏍᎬᎢ.

source: l am hanging my shirt on the line.
chr: ᎠᏏᎳᏛ ᎦᏛᎥᏍᎦ ᎠᏆᎿᏬ.

source: This boy ate five of the cucumbers.
chr: ᎯᎠ ᎠᏧᏣ ᎯᏍᎩᎭ ᎦᎦᎹ ᏚᏍᏗᎬᎢ.

source: He borrowed my paddle yesterday.
chr: ᎦᎦᏪᏍᏗ ᎠᏆᏙᎸᎡᎸ ᏒᎯ ᏥᎨᏒᎢ.

source: Three of them are taking turns rowing the boat.
chr: ᏦᎢᎭ ᎢᏯᏂᎢ ᏓᎾᏓᏁᏟᏴ ᏓᏂᎦᏪᏍᎬᎢ ᏥᏳ.

source: The reason he is so strong is because he is always lifting heavy objects.
chr: ᏂᎪᎯᎸ ᎦᎨᏓ ᎠᏌᎳᏓᏅᎲᏍᎬ ᏂᏗᎦᎵᏍᏙᏗ ᏥᏄᏟᏂᎬᎦ.

source: Who is going to drive the car?
chr: ᎦᎩ ᏛᎯᎴᏏ ᏓᏆᎴᎠ?

source: Who is the man wearing the blue cap?
chr: ᎦᎪ Ꮎ ᏌᎪᏂᎨ ᎤᎵᏍᏚᎵ ᏥᎩ ᎠᏍᎦᏯ?

source: The wheel went into the water when it came off.
chr: ᎠᎹᏱ ᏭᏕᎵᏨ ᎦᏆᏘᏗ ᎤᏓᏆᏕᏍᏔᎾ.

source: A woodpecker is pecking on a pole.
chr: ᎨᏛ ᎦᏆᏲᎯᎭ ᏓᎳᎳ.

source: He used wedges in splitting posts.
chr: ᏗᎦᎭᏘᏗ ᏚᏭᏔᏅ ᎨᏛᏍᏗ ᏓᏍᏡᏍᎬᎢ.

source: What is the man putting in the can?
chr: ᎦᏙ ᎤᏍᏗ ᎦᎵᏗ ᏔᎷᎩᏍᎩ Ꮎ ᎠᏍᎦᏯ?

source: Hand me the sugar bowl.
chr: ᎧᎵᏎᏥ ᎦᎵᏙᏗ ᎡᏍᎬᏏ.

source: Seven days make one week.
chr: ᎦᎵᏉᎩ ᏧᏒᎯᏓ ᏒᎾᏙᏓᏆᏍᏗ ᏂᎦᎵᏍᏗᏍᎪᎢ.

source: You will be the seventh.
chr: ᏂᎯ ᎦᎵᏉᎩᏁ ᎨᏎᏍᏗ.

source: When he broke an arrow, he went and got another one.
chr: ᎦᏟᏓ ᎤᏲᏍᏔᎾ, ᏄᏓᎴ ᏭᏴᎲᎢ.

source: Early at night he's already asleep.
chr: ᎩᎳ ᎤᏒ ᎦᏳᎳ ᎦᏟᎰᎢ.

source: She's gathering hickory nuts to make kanuchi.
chr: ᏐᎯ ᏕᎦᏟᏏᎭ ᎦᏅᏥ ᎤᏬᏢᏙᏗ.

source: What kind of wood do you use when you make a bow?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏓ ᎲᏗᏍᎪ ᎦᎵᏣᏗ ᏱᏦᏢᎿ?

source: I am going to build a house.
chr: ᎦᎵᏦᏕ ᏓᎦᏁᏍᎨᎯ.

source: He's buying some metal roofing.
chr: ᏔᎷᎩᏍᎩ ᎦᎵᏦᏛᏙᏗ ᏚᏩᏍᎦ.

source: When he goes fishing, he lives in a tent.
chr: ᎠᎹᏱ ᏳᏑᏁᎾ ᎦᎵᏦᏛ ᏩᏯᎣᎢ.

source: He piled the gravel on the road.
chr: ᏅᏯ ᏧᎾᏍᏗ ᎤᏩᏡᏅ ᏅᏃᎯ.

source: I tied up the prisoner up with a rope.
chr: ᏍᏕᏱᏓ ᎬᏗ ᏥᏯᎸᎸ ᎠᏴᎩ.

source: The workers are putting some rocks in a hole in the ground.
chr: ᏧᏂᎸᏫᏍᏓᏁᎯ ᏅᏯ ᏓᏂᏢᏍᎦ ᎦᏙᎯ ᎠᏔᎴᏒᎢ.

source: The children were getting sleepy; that's why we came back.
chr: ᏗᏂᏲᏟᏛ ᏓᏂᏢᏍᎬ ᎥᏍᎩᏅ ᎢᏳᏍᏗ ᏛᎣᎦᏂᎩᏒᎢ.

source: Take a coat, because it's cold.
chr: ᎦᏌᎴᏂ ᎯᏄᎦ, ᎤᏴᏜᎮᏃ.

source: I am holding a new shirt.
chr: ᎢᏤ ᎠᎿᏬ ᏥᏁᎭ.

source: He's handling a dead snake.
chr: ᎢᎾᏓ ᎤᎵᏬᏨ ᎦᏂᏙᎭ.

source: The collar on the shirt just came off.
chr: ᎠᎿᏬ ᎦᏯᏢ ᎾᏛᎾᏕᏍᏓ

source: He made an extremely beautiful saddle.
chr: ᎤᏬᏚᏨ ᎦᏯᎱᎶ ᎤᏬᏢᏅᎢ.

source: What is the rabbit eating?
chr: ᎦᏙ ᎤᏍᏗ ᎦᏰᎠ ᏥᏍᏚ?

source: Green beans are good to eat.
chr: ᎠᏂᏤ ᏚᏯ ᎠᏃᏍᏓ ᏗᎦᏰᏍᏗ.

source: He ripped an old cloth to wash the car.
chr: ᎤᏪᏘ ᎠᎿᏬ ᎤᏩᏣᎦᎸᎲ ᏓᏆᎴᎳ ᎤᏅᎦᎸᏙᏗ.

source: When the cat wants to go inside the house, he scratches on the door.
chr: ᎦᎵᏦᏕ ᎤᏴᏍᏗ ᏳᏚᎵ ᏪᏌ, ᎦᎶᎯᏍᏗ ᏕᎦᏣᎵᎪᏍᎪᎢ.

source: He has a fast car.
chr: ᎦᏣᏄᎵ ᏓᏆᎴᎳ ᎤᎭ.

source: When I had a cold, a doctor gave me an injection.
chr: ᎤᏴᏜ ᏣᎩᏂᏱᏍᎬ ᎠᎦᎾᎦᏘ ᎠᎩᏣᏲᏢᎢ.

source: I guess she's just about finished washing because she is wringing the clothes.
chr: ᏚᎩᎶᎣᏂᏗ ᎠᏎ, ᏕᎦᏨᏩᏍᏗᎭᎮᏃ ᏗᎿᏬ.

source: What is the wasp stinging?
chr: ᎦᏙ ᎤᏍᏗ ᎦᏨᏯᏍᎦ Ꮎ ᎧᎾᏥᏍᏕᏥ?

source: I almost brought my dog, but l left it behind.
chr: ᎠᎴ ᎩᏟ ᏂᏓᏥᏯᏘᏄᎦ ᎠᏎᏅ ᏓᏥᏯᎧᎯᏯ.

source: I am giving him one cat.
chr: ᏌᏊ ᏪᏌ ᏥᏯᎧᏁᎭ.

source: He bought ten bundles of young onion plants.
chr: ᏍᎪᎯ ᏂᏕᎦᏛᎥ ᏒᎩ ᏗᎦᎪᏗ ᏚᏩᏒᎢ.

source: l am wrapping a Christmas gift.
chr: ᏓᏂᏍᏓᏲᎯᎲ ᎠᏓᏁᏗ ᏥᏇᏅᏍᎦ.

source: He put the knife in his pocket.
chr: ᎤᏜᏩᏛ ᎤᎳᏛ ᎭᏰᎵᏍᏗ.

source: He bought a new tool box.
chr: ᎢᏤ ᎬᏔᏅᏙᏗ ᏗᎦᎳᏗᏍᏙᏗ ᎤᏩᏒᎢ

source: Which street do you live on?
chr: ᎦᏙ ᎤᏍᏗ ᎦᎳᏅᏗ ᎯᏁᎳ?

source: He took a half dollar out of his pocket. She took some clothes out of a basket
chr: ᎠᏰᏟ ᎤᎴᏒ ᎤᏜᏩᏛᎢ. ᏗᎿᏬ ᏚᎴᏒ ᏔᎷᏦᎯ.

source: When the dog chased the cat, the cat climbed a tree.
chr: ᏪᏌ ᎤᎨᎮᎾ ᎩᏟ, ᏪᏌ ᏡᎬᎢ ᎤᎸᏒᎢ.

source: A blacksnake likes to eat eggs.
chr: ᏧᏪᏥ ᏧᎩᏍᏗ ᎤᎸᏉᏗ ᎦᎴᎩ.

source: They pierced their ears to wear earrings.
chr: ᏗᏂᎴᏂ ᏚᏂᏔᎴᏒᎢ ᏧᎾᏟᎠᏛᏗᎢ.

source: When he placed his hand on the stove, he was burned.
chr: ᎣᏏ ᏭᏏᏔᏓ, ᎤᎴᏴᏒᎢ.

source: When the wind blew hard, the tree fell.
chr: ᏍᏓᏱ ᎤᏃᎸᎾ, ᏡᎬ ᎤᎴᏴᏒᎢ.

source: The children are climbing around on an oak tree.
chr: ᏧᏍᎦ ᏡᎬ ᎠᏂᎵᏙ ᏗᏂᏲᏟ.

source: The forest burned for three days.
chr: ᏦᎢ ᏧᏒᎯᏓ ᎤᎵᏨ ᎢᎾᎨᎢ.

source: He's in the garden picking corn.
chr: ᏠᎨᏏ ᏪᏙᎭ ᏎᎷ ᏫᏗᎦᎵᎭ.

source: When a dog was run over by a car, it died.
chr: ᏓᏆᎴᎳ ᎤᏗᏅᏔᎾ ᎩᏟ, ᎤᎵᏬᏨᎢ.

source: The fat man is trying to lose weight.
chr: Ꮎ ᎦᎵᏦᎯᏓ ᎠᏍᎦᏯ ᎠᏁᎵᏗ ᎤᏓᎨᏒ ᎤᏲᎱᏎᏗᎢ.

source: He spanked his son.
chr: ᎤᏪᏥ ᎠᏧᏣ ᎤᎵᎥᏂᎸᎢ.

source: He hoes his garden every day.
chr: ᏧᏙᏓᏋᏓ ᎦᎶᎩᏍᎪ ᎤᏫᏒᏅᎢ.

source: Where did you put the hoe?
chr: ᎭᏢ ᏣᏕ ᎦᎶᎪᏗ?

source: He is cleaning a gun.
chr: ᎦᎶᏇ ᎦᏅᎦᎵᎭ.

source: My neighbor stopped by on his way to the store
chr: ᎾᎥ ᎢᏦᎩᎾᏓᎵ ᎤᎶᎯᏍᏔᏅ ᏗᏓᎾᏅ ᏩᎦᏘ.

source: He went through the doorway.
chr: ᎪᎶᎯᏍᏗ ᏭᎦᏛᎴᏒ.

source: He tried to overtake me, but I was walking to fast.
chr: ᎠᎩᎶᎯᏎᏗ ᎤᏁᎵᏔᏅ ᎠᏎᏅ ᎦᏣᏄᎵ ᎦᎢᏒᎢ.

source: His birthday is in August
chr: ᎦᎶᏂ ᎧᎸ ᎤᏕᏘᏱᏍᎩ.

source: Whenever someone is not alert, he tricks him.
chr: ᏄᎦᏎᏍᏛᎾ Ᏹgi ᎩᎶ ᎦᎶᏂᏍᏗᏍᎪᎢ.

source: I was going to oil the sewing machine, but she had already oiled it.
chr: ᏙᏓᏥᎶᏁᎢᏒ ᎦᏰᏫᏍᎩ ᎠᏎᏅ ᎦᏳᎳ ᏧᎶᏁᏓ ᎦᏒᎢ.

source: Knock the bug off the potato.
chr: ᎯᎶᏅᏓ ᏥᎪᏯ ᏄᏅ ᏧᎩᎳ.

source: Whenever he thinks he can get away with it, he cheats.
chr: ᏁᎳᎩ ᏱᎬᏩᏛᏅᏗ ᏰᎵᎠ, ᎦᎶᏄᎮᏍᎪᎢ.

source: He passed by us without even saying anything. He passed easily when he was tested.
chr: ᎪᏍᏗ ᏄᏛᏅᎾ ᎤᎶᏒ ᎣᏥᏙᎾᎥ ᎾᎥᎢ. ᎠᎯᏓ ᎤᎶᏒ ᎠᏥᎪᎵᏰᎠ.

source: He almost fell.
chr: ᎠᎴ ᏄᎶᏒᎢ.

source: He arrives at five o' clock
chr: ᎯᏍᎩ ᎢᏳᏩᏂᎸ ᎦᎷᎪᎢ.

source: Why didn't they start? Was there something missing?
chr: ᎦᏙ ᏄᎾᎴᏅᎲᎾ? ᎪᎱᏍᏗᏍ ᎦᎷᎶᎨ?

source: He used an axe to fell the tree.
chr: ᎦᎷᏯᏍᏗ ᎤᏮᏔᏅ ᎤᎴᏴᏍᏔᏅ ᏡᎬᎢ.

source: If you don't keep the mattresses clean, bed bugs will get on them.
chr: ᏧᏓᏅᎦᎸᏓ ᏂᏙᏩᏅᎾ ᏱᎩ ᏗᏤᏍᏙ ᎦᎷᏯᏍᏗ ᏯᎾᎩᎸᎥᎦ.

source: He is chopping on a big tree.
chr: ᎤᏔᎾ ᏡᎬᎢ ᎦᎷᏯᏍᎦ.

source: Where is the laundry basket?
chr: ᎭᏢ ᏗᎦᏓᎭ ᏗᎿᏩ ᏗᎦᎸᏙᏗ?

source: Did you beat him up when you two fought?
chr: ᎯᎸᏂᎴᎢᏍ ᏥᏍᏓᏟᎸ?

source: Is heaven high in the sky?
chr: ᎦᎸᎳᏗᏍ ᎦᎸᎶ ᎦᎸᎳᏗ?

source: The airplane is flying high.
chr: ᏥᏳ ᎦᎸᎳᏗ ᎦᏃᎯᎵ.

source: The ball flew above your head.
chr: ᎯᏍᎪᎵ ᎦᎸᎳᏗᏜ ᎦᏃᎯᎸᏍᎦ ᏍᏆᏞᏍᏗ.

source: Climb up higher.
chr: ᎦᎸᎳᏗᎨ ᏫᎶᎦ.

source: The Sky is blue.
chr: ᎦᎸᎶ ᏌᎪᏂᎨᎢ.

source: He put the dead snake in a hole in the ground
chr: ᎦᏙᎯ ᎠᏔᎴᏒ ᎤᎸᏅ ᎢᎾᏓ ᎤᎵᏬᏨᎢ.

source: Hurry! Let's get there before he sells the house.
chr: ᏄᎳ! ᏄᎾᏗᏅᏓᏊ ᎦᎵᏦᏕ ᏫᏂᏧᏨᎢ.

source: He has a lot of livestock on his place.
chr: ᏥᏍᏈᏍᏗ ᎦᎾᏝᎢ ᎤᏴᏗᏓᎾ ᎤᏤᎵᎪᎯ.

source: I'm hiring him for as long as he wants to work.
chr: ᎤᏚᎵᏍᎬ ᎢᎪᎯᏓ ᏧᎸᏫᏍᏓᏁᏗ ᏥᎾᏢᏍᎦ.

source: Who is that lazy man?
chr: ᎦᎪ Ꮎ ᎦᎾᎵ ᎠᏍᎦᏯ?

source: This is a gelding.
chr: ᎯᎠ ᏐᏈᎵ ᎦᎾᎵ.

source: Where did you find the belt?
chr: ᎠᏢ ᏣᎾᏩᏛᎮ Ꮎ ᎠᏓᎶᏍᏗ?

source: Are you going to take a coat?
chr: ᎦᏌᎴᏂᏍ ᏘᎾᏫᏛᎯ?

source: He has a dangerous job.
chr: ᎦᎾᏰᎩ ᏧᎸᏫᏍᏓᏁᏗ ᎤᎭ.

source: Where did you get your cap?
chr: ᎭᏢ ᏣᏁᏎ ᏣᎵᏍᏚᎶ?

source: I am changing the wheel.
chr: ᎦᏆᏛ ᏥᏁᏟᏴᎠ.

source: He has a shirt made of deer skin.
chr: ᎠᏫ ᎦᏁᎦ ᎪᏢᏔᏅ ᎠᎿᏩ ᎤᎾᎠ.

source: Take three bats to the baseball diamond.
chr: ᏦᎢᎭ ᏗᎪᏍᏛᏂᏍᏗ ᏘᏄᎦ ᎤᎾᎳᏍᎦᎵᏗᎢ.

source: He likes cucumbers so well, he eats them without peeling them.
chr: ᏂᏚᏁᎦᎳᎸᏓᏊ ᏓᏍᏗᎩᏍᎪ ᎦᎦᎹ ᎢᎦ ᏧᎸᏉᏗ.

source: She got a gallon of milk.
chr: ᏑᏟᎶᏓ ᎢᎦ ᎤᏅᏗ ᎤᏁᎩᏒᎢ.

source: He's milking a cow.
chr: ᎤᏅᏗ ᎦᏁᎩᎡᎭ ᏩᎦ.

source: Did you find out who was bewitching you?
chr: ᏣᏕᎶᎰᏎᎢᏍ ᎤᏍᎩᎾ ᏣᏁᎫᏗᏍᎬ?

source: He is holding a 20-guage shotgun.
chr: ᏔᎳᏍᎪ ᎠᏃᏪᎵ ᎤᏒᏕᎾ ᎦᎶᏇ ᎦᏁᎭ.

source: How much milk did you leave?
chr: ᎯᎳ ᎢᎦ ᎤᏅᏗ ᏣᏁᎯᏰᎢ?

source: I just gave him water to drink.
chr: ᎠᎹ ᎤᏗᏔᏍᏗ ᏥᏁᎥᏏ.

source: The dog is trying to find some water.
chr: Ꮎ ᎩᏟ ᎠᎹ ᎤᏁᏩᏛᏗ ᎠᏁᎯᏗᎭ.

source: He took some water to the workers.
chr: ᏧᏂᎸᏫᏍᏓᏁᎯ ᎤᎾᏗᏔᏍᏗ ᎠᎹ ᎤᏁᏫᏛᎲᎢ.

source: A ball hit him on his chest.
chr: ᎦᏁᏥ ᎤᏩᏂᎸ ᏍᏆᏞᏍᏗ.

source: He lives in a new house.
chr: ᎢᏤ ᎠᏓᏁᎸ ᎦᏁᎳ.

source: Is your friend married?
chr: ᎦᏁᎵᏍ ᏍᏓᎵᎢ?

source: The roads are freezing.
chr: ᏕᎦᎾᏅ ᏕᎦᏁᏍᏓᎳᏗᎠ.

source: One year ago today it hailed hard.
chr: ᏚᏕᏘᏴᏌ ᏥᎨᏒ ᎪᎯ ᎢᎦ ᏍᏓᏯ ᎤᏁᏐᏯᏒᎢ.

source: A carpenter always uses a saw when building houses.
chr: ᏗᏁᏍᎨᏍᎩ ᏂᎪᎯᎸ ᎦᏅᏙᎩ ᎬᏗᏍᎪ ᏓᏁᏍᎨᏍᎬᎢ.

source: He always brushes his teeth after every meal.
chr: ᏂᎪᎯᎸ ᏳᎵᏍᏓᏴᏃᎿ ᏕᎦᏅᎦᎵᏍᎪᎢ ᏕᎦᏅᏙᎬᎢ.

source: I'll just lie on the floor.
chr: ᎡᎳᏗᏊ ᏥᏅᎨᏍᏗ.

source: He burned his tongue drinking hot coffee.
chr: ᎦᏅᎪ ᎦᎴᏴᎯ ᎧᏫ ᎤᏗᏞᎩ ᎠᏗᏔᏍᎬᎢ.

source: When he stepped into the swimming pool he agitated the water.
chr: ᎠᏓᏬᏍᏗ ᎤᏚᎿ ᎤᏅᏆᎡᎲ ᎠᎹ.

source: I am taking some drinking water for the workers.
chr: ᏧᏂᎸᏫᏍᏓᏁ ᎤᎾᏗᏔᏍᏗ ᎠᎹ ᏥᏅᏤᎦ.

source: I have five gallons of milk
chr: ᎯᏍᎩ ᎢᏳᏟᎶᏓ ᎤᏅᏗ ᏥᏅᏤᎭ.

source: He's handling some poison.
chr: ᏅᏬᏘ ᎠᏗᎯᎯ ᎦᏅᏥᏙᎭ.

source: Where did the salesman go?
chr: ᎭᏢ ᏫᎦᎶᎯ Ꮎ ᎦᏅᏔᏂᏙᎯ?

source: A bullet hit him in his shoulder.
chr: ᎦᏂ ᎤᏩᏂᎸ ᎦᏅᏬᎢ.

source: The dog is trying to catch his tail.
chr: ᎦᏂᏓᏛ ᎤᏂᏱᏗ ᎠᏁᎵᏗᎭ ᎩᏟ.

source: Who had the bat last?
chr: ᎦᎪ ᎣᏂ ᎤᏩᏂᏙᎴ ᎪᏍᏛᏂᏍᏗ?

source: I don't hate anyone.
chr: Ꮭ ᎩᎶ ᏱᏥᏂᏆᏘᎰᎢ.

source: Where shall I set up the bed?
chr: ᎭᏢ ᎢᏴ ᏓᏥᏂᏝᏗ?

source: She has a bedstead that belonged to her mother.
chr: ᎤᏥ ᎤᏤᎵ ᎢᏳᎵᏍᏔᏅ ᎦᏂᏝᏗᏍᏗ ᎤᏩᏯ.

source: The man is going to buy a bed.
chr: Ꮎ ᎠᏍᎦᏯ ᎦᏂᏟ ᏓᏳᏩᏏ.

source: When the chief spoke, he urged the people to work together.
chr: ᎤᎬᏫᏳᎯ ᎤᏬᏂᏌ, ᏚᏂᎳᏕᎸ ᏴᏫ ᏧᎾᎵᏍᏕᎸᏗ

source: He buried a dead snake
chr: ᎢᎾᏓ ᎤᎵᏬᏨ ᎤᏂᏓᏅᎢ.

source: He left his shirt when he escaped from jail.
chr: ᏧᎾᏓᏍᏚᏗ ᎤᎵᏘᏌ ᎤᏂᏯᏍᏔᏅᎢ.

source: Catch the dog. When was he arrested?
chr: Ꮎ ᎩᏟ ᎯᏂᏯ. ᎯᎳᏴ ᏥᎨᏒ ᎠᏥᏂᏴᎮ?

source: He wants to become a catcher.
chr: ᎦᏂᏱᏍᎩ ᎢᏳᎵᏍᏙᏏ ᎤᏚᎵᎭ.

source: He hunts all the time in the winter.
chr: ᎪᎳ ᏱᎩ ᏂᎪᎯᎸ ᎦᏃᎭᎵᏙᎰᎢ.

source: A hunter is going across a field.
chr: ᎦᏃᎭᎵᏙᎯ ᏂᏚᎾᏗᏫᏍᏗ ᏠᎨᏏ.

source: An airplane just flew by.
chr: ᏥᏳ ᎦᏃᎯᎸᏍᏓ.

source: Sometimes spring creek floods.
chr: ᏴᏓᎭ ᏥᏍᏛᏃᏱ ᎤᏪᏴ ᎦᏃᎱᎩᏍᎪᎢ.

source: When he rang the bell, church services started.
chr: ᎤᎭᎸᏂ ᎤᏃᏴᏟᏍᏔᎾ ᏓᏂᎳᏫᎬ ᎤᏓᎴᏅᎲᎢ.

source: He wants some leather to make belts.
chr: ᏗᏓᏠᏍᏗ ᏧᏬᏢᏙᏗ ᎦᏃᏥ ᎤᏚᎵᎭ.

source: Cool winds blow in the evening.
chr: ᎤᏁᏌᏴᏜ ᎦᏃᎸᎥᏍᎪ ᏒᎯᏰᏱ.

source: He's in jail for stealing a car.
chr: ᏓᏆᎴᎳ ᎤᏃᏍᎩᏒ ᎢᏳᏍᏗ ᏧᎾᏓᏍᎫᎩ ᏩᏯᎠ.

source: I don't want to buy anything that has been stolen.
chr: Ꮭ ᏯᏆᏚᎵ ᎪᎱᏍᏗ ᎦᏃᏍᎩᏓ ᎠᎩᏩᎯᏍᏗᎢ.

source: A thief was caught stealing.
chr: ᎦᏃᏍᎩᏍᎩ ᎠᏥᏩᏛᏔᏅ ᎦᏃᏍᎩᏍᎬᎢ.

source: 1. The boat is sinking. 2. When will he be buried?
chr: 1. ᏥᏳ ᎦᏃᏴᎦ. 2. ᎯᎳ ᎢᏴ ᎦᏃᏴᎨᏍᏗ?

source: Can you pull a car for me?
chr: ᎡᎵᏊᏍ ᏓᏆᎴᎳ ᏱᏍᎩᎾᏌᏁᏏ?

source: Throw that stick away.
chr: ᎤᏟ ᏫᏣᏚᎦ Ꮎ ᎦᏲᏍᏓ.

source: Let me drag it for awhile.
chr: ᎠᏴ ᏥᎾᏏᏄᎦ ᏞᎦ.

source: When it got hot inside, I went out.
chr: ᎤᎵᏞᎲᏌ ᎦᎵᏦᏕ ᏗᏜ, ᎠᎩᎤᎪᏨᎢ.

source: Can you tell me where the exit is?
chr: ᎡᎵᏊᏍ ᏱᏍᎩᏃᎯᏍ ᎤᎿ ᎪᏢᏒ ᎦᏄᎪᎢᏍᏙᏗᎢ?

source: He is mowing the grass.
chr: ᎦᏄᎸ ᎠᎦᎵᏍᎦ.

source: He's repairing a lawn mower.
chr: ᎦᏄᎸ ᎠᎦᎵᏍᏗ ᎠᎦᎵᏍᎦ.

source: The strong man is twisting steel.
chr: Ꮎ ᎤᏟᏂᎩᏓ ᎠᏍᎦᏯ ᏔᎷᎩᏍᎩ ᎦᏄᏖᏲᎭ.

source: He fired about ten times, but he missed the target over and over.
chr: Ꮲ ᏍᎪᎢ ᎢᏳᏩᎦᏗ ᏂᏚᏌᏎᏅ ᎠᏎᏅ ᏚᏅᏗᏍᎢᎶᎥ ᎠᎪᏂᏍᎬᎢ.

source: She's feeding a baby on her breast.
chr: ᎦᏅᏗ ᎠᏍᏛᎥᏍᎦ ᎤᏍᏗᎢ.

source: He fell hard playing ball.
chr: ᏍᏓᏱ ᎤᏅᏨ ᎠᎳᏍᎦᎵᏍᎩᎥᎢ.

source: I'm cleaning my fingernails.
chr: ᏓᏆᏑᎦᏢ ᏕᏥᏅᎦᎵᎠ.

source: He's hammering on a nail.
chr: ᏴᎩ ᎦᎭᏛ ᏓᏅᏆᎶᎠ.

source: A hammer is a carpenter's tool.
chr: ᎦᏅᏆᎶᏍᏗ ᏥᎩ ᏗᏁᏍᎨᏍᎩ ᎤᏮᏔᏂᏓᏍᏗ.

source: They fix horseshoes at a blacksmith shop.
chr: ᎦᏅᏆᎶᏍᎩᎢ ᎣᏍᏓ ᏂᏓᏅᏁᎰ ᏐᏈᎵ ᏧᎾᎳᏍᏑᎶ.

source: Mountain climbers carry long ropes.
chr: ᎣᏓᎸ ᎠᏂᎴᎩ ᏗᎦᏅᎯᏓ ᏍᏕᏱᏓ ᏓᏂᏁᎰᎢ.

source: When he roped the calf, he tied up its legs. Put your brakes on!
chr: ᏩᎦ ᎠᎩᎾ ᎤᏍᎳᏓ ᏚᏅᏠᏢᎢ. ᏘᏅᏠᎦ!

source: Pull the brake! He ran out of brakes.
chr: ᎦᏅᏠᏍᏗ ᏫᎾᏌᎾᎩ. ᏗᎦᏅᏠᏍᏗ ᏚᏨᏁᎸᎢ.

source: I live near highway 33.
chr: ᏦᏍᎪ ᏦᎢ ᎪᏪᎵ ᎦᏅᏅ ᎾᎥ ᏥᏁᎳ.

source: He tossed about all night.
chr: ᎤᎵᏨᏓᏆᏓ ᎤᏅᏥᏙᎸᎢ.

source: I gave him a new shirt.
chr: ᎢᏤ ᎠᎿᏬ ᏥᏅᏁᎸᎢ.

source: My grandfather used to smoke a corncob pipe.
chr: ᏎᎷ ᎤᏓ ᎪᏢᏔᏅ ᎦᏅᏃᏩ ᎪᎦᏍᏗᏍᎩ ᎨᏒᎢ ᎡᏚᏚ.

source: He's eating a turkey leg.
chr: ᎬᎾ ᎦᏅᏍᎨ ᎠᏍᏗᎩᎠ.

source: He was shot in his leg in a war, and it had to be amputated.
chr: ᎦᏅᏍᎨᏂ ᎤᏩᏌᏙᏴ ᏍᏆᏞᏍᏗ.

source: His shoulder hurts from throwing the ball hard.
chr: ᎦᏅᏬ ᎤᏪᏍᏓᏁ ᎠᏍᏓᏴ ᎤᏗᏅᏒ ᏍᏆᏞᏍᏗ.

source: He pushed the car for a mile before it started.
chr: ᏑᏟᎶᏓ ᎢᏳᏓᏅᎯᏓ ᎤᏩᏌᏙᏴ ᏓᏆᎴᎳ ᎩᎳ ᎤᏂᎩᏒᎢ.

source: He uses all his strength when he rolls the big wheel.
chr: ᏄᏟᏂᎬᎬ ᎬᏗᏍᎪ ᏳᏩᏌᏆᎴᏝ Ꮎ ᎤᏔᎾ ᎦᏆᏘᏗ.

source: They have a round dinner table at home.
chr: ᎦᏌᏆᎸ ᎦᏍᎩᎶ ᎠᎵᏍᏓᏴᏗ ᎤᏂᏍᎩᎳ ᏧᏁᏅᏒᎢ.

source: Put on a coat when you go outside.
chr: ᎦᏌᎴᏂ ᎭᎿᏬᎥ ᏙᏱ ᎮᏒᎢ.

source: The fire started at the roof when the house burned.
chr: ᎦᏌᎾᎵ ᏓᏳᎴᏅᎲ ᎠᏓᏪᎳᎩᏍᎬ Ꮎ ᎦᎵᏦᏕ ᏧᎪᏅᎢ.

source: She's threading a needle. The old car left a trail of smoke as it took off.
chr: ᎠᏍᏘ ᎦᏌᏁᎾᏛᏍᎦ ᏴᎩᎢ. ᏧᎦᏒᏍᏗ ᎤᏩᏌᏁᎾᏛᏅ ᎤᏪᏘ ᏓᏆᎴᎳ ᎤᏓᎾᏫᏍᏔᎾ.

source: Set up twenty chairs.
chr: ᏔᎵᏍᎪ ᏗᎦᏍᎩᎶ ᏗᏥᏍᎩᎳᏓ.

source: She's looking for a new dining table.
chr: ᎢᏤ ᎦᏍᎩᎶ ᎠᎵᏍᏓᏴᏗ ᎤᏲᎭ.

source: My uncle made a rocking chair.
chr: ᎠᏍᎩᎶ ᎯᏟᎨᏍᎩ ᎤᏬᏢᏅ ᎡᏚᎢ.
